RhinoInside.Revit API Documentation
GeometryEncoder.ToLines Method
 Converts the specified Rhino.Geometry.Polyline to an equivalent array of Autodesk.Revit.DB.Line.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Line[] ToLines(
	this Rhino.Geometry.Polyline polyline
)
@staticmethod
def ToLines(
	polyline: Rhino.Geometry.Polyline
) -> Autodesk.Revit.DB.Line[]
Parameters
polyline
Type: Rhino.Geometry.Polyline
Rhino polyline to convert.
Return Value
Type: Autodesk.Revit.DB.Line[]
A Revit line array that is equivalent to the provided Rhino polyline.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToLines(Polyline) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Line[] revitLines = rhinoPolyLine.ToLines();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4from System import Array
5import Autodesk.Revit.DB as DB
6import RhinoInside.Revit.Convert.Geometry
7clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
8
9revit_lines: Array[DB.Line] = rhino_polyline.ToLines()
 Using ToLines(Polyline) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Line[] revitLines = GeometryEncoder.ToLines(rhinoPolyLine);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4from System import Array
5import Autodesk.Revit.DB as DB
6import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
7
8revit_lines: Array[DB.Line] = ge.ToLines(rhino_polyline)
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace